#### 🖌 Terraform Format and Style ->`success`
#### ⚙️ Terraform Initialization ->`success`
#### 📖 Terraform Plan ->`success`

<details><summary>Show Plan</summary>

```terraform
random_integer.env: Refreshing state... [id=2128]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online]
azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/microsoft.insights/components/ai-espc-2021]
azurerm_sql_server.sqlazure: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.Sql/servers/sql-azure-espc-2021]
azurerm_sql_firewall_rule.sqlallowtfhost: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.Sql/servers/sql-azure-espc-2021/firewallRules/sqlfirewall-2128]
azurerm_sql_firewall_rule.sqlallowazureresources: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.Sql/servers/sql-azure-espc-2021/firewallRules/sqlallowazureresourcesrule]
azurerm_sql_database.db: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.Sql/servers/sql-azure-espc-2021/databases/sql-db-espc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_sql_firewall_rule.sqlallowtfhost will be updated in-place
  ~ resource "azurerm_sql_firewall_rule" "sqlallowtfhost" {
      ~ end_ip_address      = "156.67.129.159" -> "13.92.23.158"
        id                  = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.Sql/servers/sql-azure-espc-2021/firewallRules/sqlfirewall-2128"
        name                = "sqlfirewall-2128"
      ~ start_ip_address    = "156.67.129.159" -> "13.92.23.158"
        # (2 unchanged attributes hidden)
    }

  # module.myacr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + login_server                  = (known after apply)
      + name                          = "espc2021demo"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-espc-online"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + trust_policy                  = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Author: @ThorstenHans, Action: `pull_request`*